# 1] Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
lst=[4,8,15,16,23,42]
d1=pd.Series(lst)
print(d1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# 2] Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
lst2=[i for i in range(0,110,11)]
d2=pd.Series(lst2)
print(d2)

0     0
1    11
2    22
3    33
4    44
5    55
6    66
7    77
8    88
9    99
dtype: int64

# 3] Create a Pandas DataFrame that contains the following data:
# Then, print the DataFrame.

In [4]:
dic={"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}
df1=pd.DataFrame(dic)
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# 4] What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

### => In Pandas, a DataFrame is a two-dimensional labeled data structure that consists of rows and columns. It can be thought of as a table, similar to a spreadsheet or SQL table. Each column in a DataFrame is a Pandas Series.
### 
### => A Pandas Series, on the other hand, is a one-dimensional labeled array that can contain any data type (e.g., integer, float, string, etc.). It has an index that labels each element in the array.

In [6]:
dic1={"Name":["Einstien","Newton"],"Work":["Theoritical Physics","Clasical Physics"]}
df2=pd.DataFrame(dic1)
print(df2)

       Name                 Work
0  Einstien  Theoritical Physics
1    Newton     Clasical Physics

In [7]:
ser=[12,23,34,45]
s=pd.Series(ser)
print(s)

0    12
1    23
2    34
3    45
dtype: int64

# 5] What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

## 1) 'head()'
## 2) 'tail()'
## 3) 'describe()'
## 4) 'drop()'
## 5) 'groupby()'

In [10]:
df3=pd.read_csv("real_estate_price_size-Copy1.csv")
df3.head()

        price     size
0  234314.144   643.09
1  228581.528   656.22
2  281626.336   487.29
3  401255.608  1504.75
4  458674.256  1275.46

In [11]:
df3.tail()

         price     size
95  252460.400   549.80
96  310522.592  1037.44
97  383635.568  1504.75
98  225145.248   648.29
99  274922.856   705.29

In [12]:
df3.describe()

               price         size
count     100.000000   100.000000
mean   292289.470160   853.024200
std     77051.727525   297.941951
min    154282.128000   479.750000
25%    234280.148000   643.330000
50%    280590.716000   696.405000
75%    335723.696000  1029.322500
max    500681.128000  1842.510000

In [13]:
df3=df3.drop(columns=["size"])
df3.head()

        price
0  234314.144
1  228581.528
2  281626.336
3  401255.608
4  458674.256

# 6] Which of the following is mutable in nature Series, DataFrame, Panel?

### => In Pandas, both Series and DataFrame are mutable in nature. This means that you can change their values and add or remove elements after they have been created.

### => However, Panel is considered deprecated since version 0.25.0 and has been removed in version 1.0.0. It has been replaced by better alternatives like MultiIndex or xarray.

# 7] Create a DataFrame using multiple Series. Explain with an example.

In [9]:
ser1=[1,3,5,7,9]
se1=pd.Series(ser1)
ser2=[0,2,4,6,8]
se2=pd.Series(ser2)
ser3=[2,3,5,7,11]
se3=pd.Series(ser3)
dic4={"odd_num":se1,"even_num":se2,"prime_num":se3}
df4=pd.DataFrame(dic4)
df4

   odd_num  even_num  prime_num
0        1         0          2
1        3         2          3
2        5         4          5
3        7         6          7
4        9         8         11